{
    "id": "1dfa3ff5-595a-4597-9852-21c8b0deae7d",
    "displayName": "CA003: Block legacy authentication",
    "state": "enabled",
    "conditions": {
        "applications": {
            "includeApplications": ["All"],
            "excludeApplications": [],
            "includeUserActions": []
        },
        "users": {
            "includeUsers": ["None"],
            "excludeUsers": [],
            "includeGroups": [],
            "excludeGroups": [],
            "includeRoles": [],
            "excludeRoles": []
        },
        "platforms": null,
        "locations": null,
        "signInRiskLevels": [],
        "clientAppTypes": [3, 5]
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [0],
        "customAuthenticationFactors": [],
        "termsOfUse": []
    },
    "sessionControls": null
}